
/* Strings for login panel. See Keychain.cpp. */

"kLoginTitle" = "Введите Ваше имя пользователя и пароль для обновления источника RSS.";
"kLoginInitialMessage"      = "Для получения доступа к источнику RSS «%@» Вам надо войти в область «%@» на %@. Ваш пароль будет отправлен как открытый текст.";
"kLoginFailedMessage"       = "Вход не удался. Введите снова Ваше имя пользователя и пароль для «%@\» на %@.\n";
"kLoginUsernameField"       = "Имя:";
"kLoginPasswordField"       = "Пароль:";
"kLoginLogInButton"         = "Войти";
"kLoginCancelButton"        = "Отменить";
"kLoginSavePasswordCheckbox"= "Запомнить этот пароль в связке ключей";


/* Error Messages */

"PSInternalErrorDescription"        = "Произошла внутренняя ошибка Publication Subscription framework.";
"PSInternalErrorFailureReason"      = "Произошла внутренняя ошибка Publication Subscription framework.";
"PSInternalErrorRecoverySuggestion" = "Выйдите и повторите попытку.";

"PSPublishSettingsErrorDescription"        = "Не удалось опубликовать источник, т.к. настройки публикации неверны.";
"PSPublishSettingsErrorFailureReason"      = "Настройки публикации неверны.";
"PSPublishSettingsErrorRecoverySuggestion" = "Проверьте настройки публикации и повторите попытку.";

"PSNotAFeedErrorDescription"        = "Не удалось загрузить источник, т.к. контент находится в неизвестном формате источника.";
"PSNotAFeedErrorFailureReason"      = "Контент находится в неизвестном формате источника.";
"PSNotAFeedErrorRecoverySuggestion" = "Проверьте, содержит ли указанное размещение источник в формате Atom или RSS.";

"PSUnsupportedPermissionsErrorDescription"          = "Не удалось опубликовать источник, т.к. тип прав доступа не поддерживается.";
"PSUnsupportedPermissionsErrorFailureReason"        = "Этот тип прав доступа не поддерживается.";
"PSUnsupportedPermissionsErrorRecoverySuggestion"   = "Проверьте тип прав доступа и повторите попытку.";

"PSUnsupportedIdentitiesErrorDescription"         = "Не удалось опубликовать источник, т.к. тип идентификации не поддерживается.";
"PSUnsupportedIdentitiesErrorFailureReason"       = "Этот тип идентификации не поддерживается.";
"PSUnsupportedIdentitiesErrorRecoverySuggestion"  = "Проверьте тип идентификации и повторите попытку.";

"NSURLErrorUserAuthenticationRequired Description" = "Требуются имя пользователя и пароль";

/* Localized date/time formats. See DateClass.cpp */

"TodayFmt"      = "'Сегодня', h:mm a";
"YesterdayFmt"  = "'Вчера', h:mm a";
"ThisWeekFmt"   = "EEEE, h:mm a";
"ThisYearFmt"   = "d, MMM, h:mm a";
"PastYearFmt"   = "d, MMM.yy, h:mm a";

/* Localizable file size formatters.  See StringClass::representationForBytes */

"0 bytes"            = "0 байт";           /* String used for showing a zero byte size */
"1 byte"             = "1 байт";            /* String used for showing a one byte size */
"%.0f bytes"         = "%.0f байт";        /* Format used to display a size between 2 and 100 bytes */
"%.1f KB (0.1)"      = "%.1f КБ";           /* Format used to display sizes between 100 and 999 bytes */
"%.1f KB (1.0)"      = "%.1f КБ";           /* Format used to display sizes between 1000 bytes and 9.9 KB */
"%.1f KB (10.0)"     = "%.1f КБ";           /* Format used to display sizes between 10 and 99.9 KB */
"%.0f KB"            = "%.0f КБ";           /* Format used to display sizes between 100 and 999 KB */
"%.1f MB (1.0)"      = "%.1f МБ";           /* Format used to display sizes between 1000 KB and 9.9 MB */
"%.1f MB (10.0)"     = "%.1f МБ";           /* Format used to display sizes between 10 and 99.9 MB */
"%.0f MB"            = "%.0f МБ";           /* Format used to display sizes between 100 and 999 MB */
"%.1f GB (1.0)"      = "%.2f ГБ";           /* Format used to display sizes between 1000 MB and 9.9 GB */
"%.1f GB (10.0)"     = "%.2f ГБ";           /* Format used to display sizes between 10 and 99.9 GB */
"%.0f GB"            = "%.0f ГБ";           /* Format used to display sizes 100 GB or greater */

/* Localizable file names. Currently only used in EnclosureCore.cpp */

"kUntitledFileName" = "Новый";   /* If we download and enclosure for which we have no other name to go by */
